In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

df = pd.read_csv('data/skylab_instagram_datathon_dataset.csv', delimiter=';')

#drop column period, primary exchange name and calculation type, 
df = df.drop(['period', 'primary_exchange_name', 'calculation_type', 'domicile_country_name'], axis=1)

#sort by period end date
df = df.sort_values(by='period_end_date', ascending=True)

#df = df[df['ultimate_parent_legal_entity_name'] == 'SWATCH GROUP AG']

#just show rows with  name hering
df = df[df['period_end_date'] > '2020-12-31']




#just take rows with period end date higher than 2020-12-31
#df = df[df['period_end_date'] > '2020-12-31']

display(df.head(5))

,period_end_date,compset_group,compset,business_entity_doing_business_as_name,legal_entity_name,ultimate_parent_legal_entity_name,followers,pictures,videos,comments,likes
195569,2021-01-02,Luxury & Premium & Mainstream,US Softlines Analyst Interest List,Zales,Signet Jewelers Ltd,Signet Jewelers Ltd,183163.0,32.0,7.0,505.0,36174.0
687138,2021-01-02,Beauty & Boutique,Beauty & Boutique,Est,KAO,KAO,16503.0,1.0,0.0,1.0,310.0
167814,2021-01-02,Luxury & Premium & Mainstream,Soft Luxury,Valentino,Valentino,Mayhoola for Investments Spc,14846655.0,87.0,19.0,5271.0,795776.0
153520,2021-01-02,Apparel Retail,Ecommerce Mainstream Apparel Retail,Wish,ContextLogic Inc,ContextLogic Inc,7277002.0,126.0,41.0,3162.0,122204.0
56891,2021-01-02,Apparel Retail,US Softlines Analyst Interest List,Banana Republic,Gap,Gap,2040463.0,182.0,14.0,4631.0,314958.0

In [2]:
columns = df.columns
print(columns)
df_sum = 0

for i in columns:
    
    print("\n")
    print("-----------------------------------------------------------------------------")
    print(i, "--> has length:", len(df[i].unique()))
    df_i = df[i].value_counts().reset_index()
    df_i.columns = [i, "count"]
    display(df_i)
    df_sum = df_i["count"].sum()
    print("Sum of count:", df_sum)
    df_sum = 0
    print("-----------------------------------------------------------------------------")
    print("\n")

#df_period = df["period"].value_counts().reset_index()
#df_period.columns = ["period", "count"]
#df_period

Index(['period_end_date', 'compset_group', 'compset',
       'business_entity_doing_business_as_name', 'legal_entity_name',
       'ultimate_parent_legal_entity_name', 'followers', 'pictures', 'videos',
       'comments', 'likes'],
      dtype='object')


-----------------------------------------------------------------------------
period_end_date --> has length: 142

    period_end_date  count
0        2023-09-16   1635
1        2023-06-17   1635
2        2023-03-25   1635
3        2023-04-01   1635
4        2023-04-08   1635
..              ...    ...
137      2021-03-06   1628
138      2021-03-13   1628
139      2021-03-20   1628
140      2021-03-27   1628
141      2021-01-02   1628

[142 rows x 2 columns]

Sum of count: 231633
-----------------------------------------------------------------------------




-----------------------------------------------------------------------------
compset_group --> has length: 20

                    compset_group  count
0   Luxury & Premium & Mainstream  69296
1                  Apparel Retail  68780
2         Sportswear & Athleisure  18176
3               Beauty & Boutique  14768
4                       Beverages  14626
5                   Food Products  14200
6                     Restaurants  11786
7    Dermatology and Orthodontics   3524
8                    Outdoor Gear   3124
9              Fitness & Exercise   2982
10                       Mattress   1704
11              Building Products   1562
12                        Petcare   1562
13                Home Appliances   1136
14            Toys & Collectibles   1086
15                 Sporting Goods    994
16                    Food Retail    852
17            Discount Retailers     765
18                  Entertainment    568
19             Study (All Brands)    142

Sum of count: 231633
-----------------------------------------------------------------------------




-----------------------------------------------------------------------------
compset --> has length: 54

                                 compset  count
0     US Softlines Analyst Interest List  36352
1                         Apparel Retail  23172
2          Luxury & Premium & Mainstream  20732
3                      Beauty & Boutique  14768
4   Global Luxury Analysts Interest List   9372
5             Omnichannel Apparel Retail   8094
6                              Beverages   7100
7                          Food Products   6816
8                Sportswear & Athleisure   6674
9               Ecommerce Apparel Retail   6558
10                          Fast Fashion   6248
11                           Soft Luxury   6106
12                           Restaurants   5680
13                               Alcohol   4970
14                           Hard Luxury   4828
15                            Sportswear   3976
16                              Footwear   3834
17                        Premium Brands   3834
18   Ecommerce Mainstream Apparel Retail   3124
19                    Fitness & Exercise   2982
20             Mid-Range Watch & Jewelry   2982
21                      Plant-Based Meat   2698
22                          Outdoor Gear   2556
23                            Athleisure   2414
24                                   QSR   2272
25                         Casual Dining   2130
26       Ecommerce Luxury Apparel Retail   1846
27                              Mattress   1704
28          Dermatology and Orthodontics   1691
29                     US Discount Store   1562
30                               Petcare   1562
31                     Plant-Based Dairy   1562
32                     Building Products   1562
33                   US Department Store   1562
34                     Mainstream Brands   1420
35                           Dermatology   1407
36                            Snack Bars   1278
37                  Latam Apparel Retail   1136
38                                  Soda   1136
39                       Home Appliances   1136
40                   Toys & Collectibles   1086
41                          Workout Gear    994
42                               Yoghurt    994
43                           Fast Casual    994
44                        Sporting Goods    994
45                           Food Retail    852
46                           Pasta Sauce    852
47                         Energy drinks    852
48                   Discount Retailers     765
49                                Coffee    710
50                         Entertainment    568
51                         Sports drinks    568
52                          Orthodontics    426
53                    Study (All Brands)    142

Sum of count: 231633
-----------------------------------------------------------------------------




-----------------------------------------------------------------------------
business_entity_doing_business_as_name --> has length: 706

    business_entity_doing_business_as_name  count
0                               All Brands   8662
1                             Fashion Nova    710
2                                Superdown    710
3                                  REVOLVE    710
4                                     Asos    710
..                                     ...    ...
701                         Sol de Janeiro    142
702                                   Temu     55
703                           ShopGoodwill     52
704                        Finding Unicorn     46
705                               Pop Mart     46

[706 rows x 2 columns]

Sum of count: 231633
-----------------------------------------------------------------------------




-----------------------------------------------------------------------------
legal_entity_name --> has length: 424

                                    legal_entity_name  count
0                 LVMH Moet Hennessy Louis Vuitton SE   9088
1                                           Richemont   6816
2                                              Swatch   6106
3                                      Anheuser-Busch   5112
4                                              Kering   3408
..                                                ...    ...
418                                          Breville    142
419                                       WhaleCo Inc     55
420              Goodwill Industries of Orange County     52
421  Shenzhen Seulin Culture & Entertainment Co., Ltd     46
422                  Pop Mart International Group Ltd     46

[423 rows x 2 columns]

Sum of count: 222971
-----------------------------------------------------------------------------




-----------------------------------------------------------------------------
ultimate_parent_legal_entity_name --> has length: 402

                    ultimate_parent_legal_entity_name  count
0                 LVMH Moet Hennessy Louis Vuitton SE   9088
1                                           Richemont   6816
2                                              Swatch   6106
3                                      Anheuser-Busch   5112
4                                              Kering   3408
..                                                ...    ...
396                                  Rosa Cha USA LLC    142
397                                         Pinduoduo     55
398             Goodwill Industries International Inc     52
399  Shenzhen Seulin Culture & Entertainment Co., Ltd     46
400                  Pop Mart International Group Ltd     46

[401 rows x 2 columns]

Sum of count: 222971
-----------------------------------------------------------------------------




-----------------------------------------------------------------------------
followers --> has length: 103094

         followers  count
0          12654.0    342
1              0.0     52
2          23461.0     29
3          40044.0     20
4          13910.0     14
...            ...    ...
103088    356775.0      1
103089  73288302.0      1
103090     74406.0      1
103091     14691.0      1
103092    260387.0      1

[103093 rows x 2 columns]

Sum of count: 229319
-----------------------------------------------------------------------------




-----------------------------------------------------------------------------
pictures --> has length: 4162

      pictures  count
0          0.0   6269
1          9.0   4242
2          8.0   4104
3         12.0   4066
4         11.0   4050
...        ...    ...
4156   22717.0      1
4157    2757.0      1
4158   80721.0      1
4159    2490.0      1
4160    5626.0      1

[4161 rows x 2 columns]

Sum of count: 231491
-----------------------------------------------------------------------------




-----------------------------------------------------------------------------
videos --> has length: 2519

       videos  count
0         0.0  25694
1         1.0  15954
2         2.0  13327
3         3.0  12143
4         4.0  11037
...       ...    ...
2513    779.0      1
2514  15598.0      1
2515   1797.0      1
2516   1027.0      1
2517    929.0      1

[2518 rows x 2 columns]

Sum of count: 231510
-----------------------------------------------------------------------------




-----------------------------------------------------------------------------
comments --> has length: 26383

       comments  count
0           0.0   5816
1          10.0    290
2          42.0    276
3          56.0    274
4           3.0    273
...         ...    ...
26377   35594.0      1
26378    7922.0      1
26379    8484.0      1
26380  146492.0      1
26381   51249.0      1

[26382 rows x 2 columns]

Sum of count: 231121
-----------------------------------------------------------------------------




-----------------------------------------------------------------------------
likes --> has length: 77097

            likes  count
0             0.0   5130
1           191.0     40
2           266.0     35
3           233.0     33
4            79.0     28
...           ...    ...
77091     10307.0      1
77092      9745.0      1
77093    276486.0      1
77094  70780903.0      1
77095      4850.0      1

[77096 rows x 2 columns]

Sum of count: 231537
-----------------------------------------------------------------------------

In [3]:
display(df.describe())

          followers       pictures         videos      comments         likes
count  2.293190e+05  231491.000000  231510.000000  2.311210e+05  2.315370e+05
mean   1.675495e+07     316.704891      84.377578  3.264462e+04  1.450647e+06
std    1.379594e+08    2612.833626     758.696448  2.940790e+05  1.200478e+07
min    0.000000e+00       0.000000       0.000000  0.000000e+00  0.000000e+00
25%    3.731370e+05      15.000000       3.000000  3.190000e+02  1.191500e+04
50%    1.289569e+06      36.000000       9.000000  1.265000e+03  6.253500e+04
75%    5.440812e+06     104.000000      27.000000  5.201000e+03  2.881020e+05
max    3.502565e+09  135714.000000   35905.000000  1.605335e+07  4.583853e+08

In [4]:
display(df.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 231633 entries, 195569 to 188398
Data columns (total 11 columns):
 #   Column                                  Non-Null Count   Dtype
---  ------                                  --------------   -----
 0   period_end_date                         231633 non-null  object
 1   compset_group                           231633 non-null  object
 2   compset                                 231633 non-null  object
 3   business_entity_doing_business_as_name  231633 non-null  object
 4   legal_entity_name                       222971 non-null  object
 5   ultimate_parent_legal_entity_name       222971 non-null  object
 6   followers                               229319 non-null  float64
 7   pictures                                231491 non-null  float64
 8   videos                                  231510 non-null  float64
 9   comments                                231121 non-null  float64
 10  likes                                   231537 non-null  float64
dtypes: float64(5), object(6)
memory usage: 21.2+ MB

None

In [5]:
df = df[df['ultimate_parent_legal_entity_name'] == 'KAO']
df.head(5)

,period_end_date,compset_group,compset,business_entity_doing_business_as_name,legal_entity_name,ultimate_parent_legal_entity_name,followers,pictures,videos,comments,likes
687138,2021-01-02,Beauty & Boutique,Beauty & Boutique,Est,KAO,KAO,16503.0,1.0,0.0,1.0,310.0
70289,2021-01-02,Beauty & Boutique,Beauty & Boutique,Sofina,KAO,KAO,23461.0,6.0,1.0,6.0,962.0
453750,2021-01-02,Beauty & Boutique,Beauty & Boutique,John Frieda,KAO,KAO,526108.0,219.0,38.0,9036.0,39475.0
325208,2021-01-02,Beauty & Boutique,Beauty & Boutique,Sensai,KAO,KAO,NaN,112.0,2.0,6694.0,22223.0
330813,2021-01-02,Beauty & Boutique,Beauty & Boutique,Kanebo,KAO,KAO,NaN,28.0,7.0,615.0,3800.0

In [6]:
# use seaborn to create a scatter plot of the data
#sns.pairplot(df)
#plt.show()

In [7]:
# use seaborn to create a scatter plot of the data
#sns.pairplot(df, hue='category')
#plt.show()

In [8]:
# use seaborn to create a heatmap of the data
#sns.heatmap(df.corr(), annot=True)
#plt.show()